GopalSaraf/Practicals/PSDL/include/proc/pic16f18446.inc
// Register: CWG2PPS
#define CWG2PPS CWG2PPS
CWG2PPS                                  equ 01EB2h
// bitfield definitions
CWG2PPS_PIN_POSN                         equ 0000h
CWG2PPS_PIN_POSITION                     equ 0000h
CWG2PPS_PIN_SIZE                         equ 0003h
CWG2PPS_PIN_LENGTH                       equ 0003h
CWG2PPS_PIN_MASK                         equ 0007h
CWG2PPS_PORT_POSN                        equ 0003h
CWG2PPS_PORT_POSITION                    equ 0003h
CWG2PPS_PORT_SIZE                        equ 0002h
CWG2PPS_PORT_LENGTH                      equ 0002h
CWG2PPS_PORT_MASK                        equ 0018h
CWG2PPS_CWG2PPS_POSN                     equ 0000h
CWG2PPS_CWG2PPS_POSITION                 equ 0000h
CWG2PPS_CWG2PPS_SIZE                     equ 0005h
CWG2PPS_CWG2PPS_LENGTH                   equ 0005h
CWG2PPS_CWG2PPS_MASK                     equ 001Fh
CWG2PPS_CWG2PPS0_POSN                    equ 0000h
CWG2PPS_CWG2PPS0_POSITION                equ 0000h
CWG2PPS_CWG2PPS0_SIZE                    equ 0001h
CWG2PPS_CWG2PPS0_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS0_MASK                    equ 0001h
CWG2PPS_CWG2PPS1_POSN                    equ 0001h
CWG2PPS_CWG2PPS1_POSITION                equ 0001h
CWG2PPS_CWG2PPS1_SIZE                    equ 0001h
CWG2PPS_CWG2PPS1_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS1_MASK                    equ 0002h
CWG2PPS_CWG2PPS2_POSN                    equ 0002h
CWG2PPS_CWG2PPS2_POSITION                equ 0002h
CWG2PPS_CWG2PPS2_SIZE                    equ 0001h
CWG2PPS_CWG2PPS2_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS2_MASK                    equ 0004h
CWG2PPS_CWG2PPS3_POSN                    equ 0003h
CWG2PPS_CWG2PPS3_POSITION                equ 0003h
CWG2PPS_CWG2PPS3_SIZE                    equ 0001h
CWG2PPS_CWG2PPS3_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS3_MASK                    equ 0008h
CWG2PPS_CWG2PPS4_POSN                    equ 0004h
CWG2PPS_CWG2PPS4_POSITION                equ 0004h
CWG2PPS_CWG2PPS4_SIZE                    equ 0001h
CWG2PPS_CWG2PPS4_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS4_MASK                    equ 0010h

// Register: MDCARLPPS
#define MDCARLPPS MDCARLPPS
MDCARLPPS                                equ 01EB8h
// bitfield definitions
MDCARLPPS_PIN_POSN                       equ 0000h
MDCARLPPS_PIN_POSITION                   equ 0000h
MDCARLPPS_PIN_SIZE                       equ 0003h
MDCARLPPS_PIN_LENGTH                     equ 0003h
MDCARLPPS_PIN_MASK                       equ 0007h
MDCARLPPS_PORT_POSN                      equ 0003h
MDCARLPPS_PORT_POSITION                  equ 0003h
MDCARLPPS_PORT_SIZE                      equ 0002h
MDCARLPPS_PORT_LENGTH                    equ 0002h
MDCARLPPS_PORT_MASK                      equ 0018h
MDCARLPPS_MDCARLPPS_POSN                 equ 0000h
MDCARLPPS_MDCARLPPS_POSITION             equ 0000h
MDCARLPPS_MDCARLPPS_SIZE                 equ 0005h
MDCARLPPS_MDCARLPPS_LENGTH               equ 0005h
MDCARLPPS_MDCARLPPS_MASK                 equ 001Fh
MDCARLPPS_MDCARLPPS0_POSN                equ 0000h
MDCARLPPS_MDCARLPPS0_POSITION            equ 0000h
MDCARLPPS_MDCARLPPS0_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS0_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS0_MASK                equ 0001h
MDCARLPPS_MDCARLPPS1_POSN                equ 0001h
MDCARLPPS_MDCARLPPS1_POSITION            equ 0001h
MDCARLPPS_MDCARLPPS1_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS1_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS1_MASK                equ 0002h
MDCARLPPS_MDCARLPPS2_POSN                equ 0002h
MDCARLPPS_MDCARLPPS2_POSITION            equ 0002h
MDCARLPPS_MDCARLPPS2_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS2_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS2_MASK                equ 0004h
MDCARLPPS_MDCARLPPS3_POSN                equ 0003h
MDCARLPPS_MDCARLPPS3_POSITION            equ 0003h
MDCARLPPS_MDCARLPPS3_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS3_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS3_MASK                equ 0008h
MDCARLPPS_MDCARLPPS4_POSN                equ 0004h
MDCARLPPS_MDCARLPPS4_POSITION            equ 0004h
MDCARLPPS_MDCARLPPS4_SIZE                equ 0001h
MDCARLPPS_MDCARLPPS4_LENGTH              equ 0001h
MDCARLPPS_MDCARLPPS4_MASK                equ 0010h

// Register: MDCARHPPS
#define MDCARHPPS MDCARHPPS
MDCARHPPS                                equ 01EB9h
// bitfield definitions
MDCARHPPS_PIN_POSN                       equ 0000h
MDCARHPPS_PIN_POSITION                   equ 0000h
MDCARHPPS_PIN_SIZE                       equ 0003h
MDCARHPPS_PIN_LENGTH                     equ 0003h
MDCARHPPS_PIN_MASK                       equ 0007h
MDCARHPPS_PORT_POSN                      equ 0003h
MDCARHPPS_PORT_POSITION                  equ 0003h
MDCARHPPS_PORT_SIZE                      equ 0002h
MDCARHPPS_PORT_LENGTH                    equ 0002h
MDCARHPPS_PORT_MASK                      equ 0018h
MDCARHPPS_MDCARHPPS_POSN                 equ 0000h
MDCARHPPS_MDCARHPPS_POSITION             equ 0000h
MDCARHPPS_MDCARHPPS_SIZE                 equ 0005h
MDCARHPPS_MDCARHPPS_LENGTH               equ 0005h
MDCARHPPS_MDCARHPPS_MASK                 equ 001Fh
MDCARHPPS_MDCARHPPS0_POSN                equ 0000h
MDCARHPPS_MDCARHPPS0_POSITION            equ 0000h
MDCARHPPS_MDCARHPPS0_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS0_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS0_MASK                equ 0001h
MDCARHPPS_MDCARHPPS1_POSN                equ 0001h
MDCARHPPS_MDCARHPPS1_POSITION            equ 0001h
MDCARHPPS_MDCARHPPS1_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS1_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS1_MASK                equ 0002h
MDCARHPPS_MDCARHPPS2_POSN                equ 0002h
MDCARHPPS_MDCARHPPS2_POSITION            equ 0002h
MDCARHPPS_MDCARHPPS2_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS2_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS2_MASK                equ 0004h
MDCARHPPS_MDCARHPPS3_POSN                equ 0003h
MDCARHPPS_MDCARHPPS3_POSITION            equ 0003h
MDCARHPPS_MDCARHPPS3_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS3_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS3_MASK                equ 0008h
MDCARHPPS_MDCARHPPS4_POSN                equ 0004h
MDCARHPPS_MDCARHPPS4_POSITION            equ 0004h
MDCARHPPS_MDCARHPPS4_SIZE                equ 0001h
MDCARHPPS_MDCARHPPS4_LENGTH              equ 0001h
MDCARHPPS_MDCARHPPS4_MASK                equ 0010h

// Register: MDSRCPPS
#define MDSRCPPS MDSRCPPS
MDSRCPPS                                 equ 01EBAh
// bitfield definitions
MDSRCPPS_PIN_POSN                        equ 0000h
MDSRCPPS_PIN_POSITION                    equ 0000h
MDSRCPPS_PIN_SIZE                        equ 0003h
MDSRCPPS_PIN_LENGTH                      equ 0003h
MDSRCPPS_PIN_MASK                        equ 0007h
MDSRCPPS_PORT_POSN                       equ 0003h
MDSRCPPS_PORT_POSITION                   equ 0003h
MDSRCPPS_PORT_SIZE                       equ 0002h
MDSRCPPS_PORT_LENGTH                     equ 0002h
MDSRCPPS_PORT_MASK                       equ 0018h
MDSRCPPS_MDSRCPPS_POSN                   equ 0000h
MDSRCPPS_MDSRCPPS_POSITION               equ 0000h
MDSRCPPS_MDSRCPPS_SIZE                   equ 0005h
MDSRCPPS_MDSRCPPS_LENGTH                 equ 0005h
MDSRCPPS_MDSRCPPS_MASK                   equ 001Fh
MDSRCPPS_MDSRCPPS0_POSN                  equ 0000h
MDSRCPPS_MDSRCPPS0_POSITION              equ 0000h
MDSRCPPS_MDSRCPPS0_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS0_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS0_MASK                  equ 0001h
MDSRCPPS_MDSRCPPS1_POSN                  equ 0001h
MDSRCPPS_MDSRCPPS1_POSITION              equ 0001h
MDSRCPPS_MDSRCPPS1_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS1_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS1_MASK                  equ 0002h
MDSRCPPS_MDSRCPPS2_POSN                  equ 0002h
MDSRCPPS_MDSRCPPS2_POSITION              equ 0002h
MDSRCPPS_MDSRCPPS2_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS2_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS2_MASK                  equ 0004h
MDSRCPPS_MDSRCPPS3_POSN                  equ 0003h
MDSRCPPS_MDSRCPPS3_POSITION              equ 0003h
MDSRCPPS_MDSRCPPS3_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS3_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS3_MASK                  equ 0008h
MDSRCPPS_MDSRCPPS4_POSN                  equ 0004h
MDSRCPPS_MDSRCPPS4_POSITION              equ 0004h
MDSRCPPS_MDSRCPPS4_SIZE                  equ 0001h
MDSRCPPS_MDSRCPPS4_LENGTH                equ 0001h
MDSRCPPS_MDSRCPPS4_MASK                  equ 0010h

