GopalSaraf/Practicals/PSDL/include/proc/pic16f18446.inc
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1EN                             BANKMASK(CM1CON0), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 0
#define C1IF                             BANKMASK(PIR2), 0
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NCH), 0
#define C1NCH1                           BANKMASK(CM1NCH), 1
#define C1NCH2                           BANKMASK(CM1NCH), 2
#define C1PCH0                           BANKMASK(CM1PCH), 0
#define C1PCH1                           BANKMASK(CM1PCH), 1
#define C1PCH2                           BANKMASK(CM1PCH), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C2EN                             BANKMASK(CM2CON0), 7
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 1
#define C2IF                             BANKMASK(PIR2), 1
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NCH), 0
#define C2NCH1                           BANKMASK(CM2NCH), 1
#define C2NCH2                           BANKMASK(CM2NCH), 2
#define C2PCH0                           BANKMASK(CM2PCH), 0
#define C2PCH1                           BANKMASK(CM2PCH), 1
#define C2PCH2                           BANKMASK(CM2PCH), 2
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CAP0                             BANKMASK(ADCAP), 0
#define CAP1                             BANKMASK(ADCAP), 1
#define CAP2                             BANKMASK(ADCAP), 2
#define CAP3                             BANKMASK(ADCAP), 3
#define CAP4                             BANKMASK(ADCAP), 4
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE6), 0
#define CCP1IF                           BANKMASK(PIR6), 0
#define CCP1MD                           BANKMASK(PMD4), 0
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE6), 1
#define CCP2IF                           BANKMASK(PIR6), 1
#define CCP2MD                           BANKMASK(PMD4), 1
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2
#define CCP3EN                           BANKMASK(CCP3CON), 7
#define CCP3FMT                          BANKMASK(CCP3CON), 4
#define CCP3IE                           BANKMASK(PIE6), 2
#define CCP3IF                           BANKMASK(PIR6), 2
#define CCP3MD                           BANKMASK(PMD4), 2
#define CCP3MODE0                        BANKMASK(CCP3CON), 0
#define CCP3MODE1                        BANKMASK(CCP3CON), 1
#define CCP3MODE2                        BANKMASK(CCP3CON), 2
#define CCP3MODE3                        BANKMASK(CCP3CON), 3
#define CCP3OUT                          BANKMASK(CCP3CON), 5
#define CCP3PPS0                         BANKMASK(CCP3PPS), 0
#define CCP3PPS1                         BANKMASK(CCP3PPS), 1
#define CCP3PPS2                         BANKMASK(CCP3PPS), 2
#define CCP3PPS3                         BANKMASK(CCP3PPS), 3
#define CCP3PPS4                         BANKMASK(CCP3PPS), 4
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2
#define CCP4EN                           BANKMASK(CCP4CON), 7
#define CCP4FMT                          BANKMASK(CCP4CON), 4
#define CCP4IE                           BANKMASK(PIE6), 3
#define CCP4IF                           BANKMASK(PIR6), 3
#define CCP4MD                           BANKMASK(PMD4), 3
#define CCP4MODE0                        BANKMASK(CCP4CON), 0
#define CCP4MODE1                        BANKMASK(CCP4CON), 1
#define CCP4MODE2                        BANKMASK(CCP4CON), 2
#define CCP4MODE3                        BANKMASK(CCP4CON), 3
#define CCP4OUT                          BANKMASK(CCP4CON), 5
#define CCP4PPS0                         BANKMASK(CCP4PPS), 0
#define CCP4PPS1                         BANKMASK(CCP4PPS), 1
#define CCP4PPS2                         BANKMASK(CCP4PPS), 2
#define CCP4PPS3                         BANKMASK(CCP4PPS), 3
#define CCP4PPS4                         BANKMASK(CCP4PPS), 4
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CH0                              BANKMASK(MD1CARH), 0
#define CH1                              BANKMASK(MD1CARH), 1
#define CH2                              BANKMASK(MD1CARH), 2
#define CH3                              BANKMASK(MD1CARH), 3
#define CHPOL                            BANKMASK(MD1CON1), 5
#define CHSYNC                           BANKMASK(MD1CON1), 4
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKE2                             BANKMASK(SSP2STAT), 6
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKP2                             BANKMASK(SSP2CON1), 4
#define CKPS3                            BANKMASK(T0CON1), 3
#define CKS0                             BANKMASK(NCO1CLK), 0
#define CKS1                             BANKMASK(NCO1CLK), 1
#define CKS2                             BANKMASK(NCO1CLK), 2
#define CKS3                             BANKMASK(NCO1CLK), 3
#define CL0                              BANKMASK(MD1CARL), 0
#define CL1                              BANKMASK(MD1CARL), 1
#define CL2                              BANKMASK(MD1CARL), 2
#define CL3                              BANKMASK(MD1CARL), 3
#define CLC1IE                           BANKMASK(PIE5), 4
#define CLC1IF                           BANKMASK(PIR5), 4
#define CLC1MD                           BANKMASK(PMD7), 1
#define CLC2IE                           BANKMASK(PIE5), 5
#define CLC2IF                           BANKMASK(PIR5), 5
#define CLC2MD                           BANKMASK(PMD7), 2
#define CLC3IE                           BANKMASK(PIE5), 6
#define CLC3IF                           BANKMASK(PIR5), 6
#define CLC3MD                           BANKMASK(PMD7), 3
#define CLC4IE                           BANKMASK(PIE5), 7
#define CLC4IF                           BANKMASK(PIR5), 7
#define CLC4MD                           BANKMASK(PMD7), 4
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3
#define CLKRDC0                          BANKMASK(CLKRCON), 3
#define CLKRDC1                          BANKMASK(CLKRCON), 4
#define CLKRDIV0                         BANKMASK(CLKRCON), 0
#define CLKRDIV1                         BANKMASK(CLKRCON), 1
#define CLKRDIV2                         BANKMASK(CLKRCON), 2
#define CLKREN                           BANKMASK(CLKRCON), 7
#define CLKRMD                           BANKMASK(PMD0), 1
#define CLPOL                            BANKMASK(MD1CON1), 1
#define CLSYNC                           BANKMASK(MD1CON1), 0
#define CMP1MD                           BANKMASK(PMD3), 1
#define CMP2MD                           BANKMASK(PMD3), 2
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOL                             BANKMASK(SMT1CON0), 2
#define CPON                             BANKMASK(ADCPCON0), 7
#define CPR0                             BANKMASK(SMT1CPRL), 0
#define CPR1                             BANKMASK(SMT1CPRL), 1
#define CPR10                            BANKMASK(SMT1CPRH), 2
#define CPR11                            BANKMASK(SMT1CPRH), 3
#define CPR12                            BANKMASK(SMT1CPRH), 4
#define CPR13                            BANKMASK(SMT1CPRH), 5
#define CPR14                            BANKMASK(SMT1CPRH), 6
#define CPR15                            BANKMASK(SMT1CPRH), 7
#define CPR16                            BANKMASK(SMT1CPRU), 0
#define CPR17                            BANKMASK(SMT1CPRU), 1
#define CPR18                            BANKMASK(SMT1CPRU), 2
#define CPR19                            BANKMASK(SMT1CPRU), 3
#define CPR2                             BANKMASK(SMT1CPRL), 2
#define CPR20                            BANKMASK(SMT1CPRU), 4
#define CPR21                            BANKMASK(SMT1CPRU), 5
#define CPR22                            BANKMASK(SMT1CPRU), 6
#define CPR23                            BANKMASK(SMT1CPRU), 7
#define CPR3                             BANKMASK(SMT1CPRL), 3
#define CPR4                             BANKMASK(SMT1CPRL), 4
#define CPR5                             BANKMASK(SMT1CPRL), 5
#define CPR6                             BANKMASK(SMT1CPRL), 6
#define CPR7                             BANKMASK(SMT1CPRL), 7
#define CPR8                             BANKMASK(SMT1CPRH), 0
#define CPR9                             BANKMASK(SMT1CPRH), 1
#define CPRDY                            BANKMASK(ADCPCON0), 0
#define CPRUP                            BANKMASK(SMT1STAT), 7
#define CPW0                             BANKMASK(SMT1CPWL), 0
#define CPW1                             BANKMASK(SMT1CPWL), 1
#define CPW10                            BANKMASK(SMT1CPWH), 2
#define CPW11                            BANKMASK(SMT1CPWH), 3
#define CPW12                            BANKMASK(SMT1CPWH), 4
#define CPW13                            BANKMASK(SMT1CPWH), 5
#define CPW14                            BANKMASK(SMT1CPWH), 6
#define CPW15                            BANKMASK(SMT1CPWH), 7
#define CPW16                            BANKMASK(SMT1CPWU), 0
#define CPW17                            BANKMASK(SMT1CPWU), 1
#define CPW18                            BANKMASK(SMT1CPWU), 2
#define CPW19                            BANKMASK(SMT1CPWU), 3
#define CPW2                             BANKMASK(SMT1CPWL), 2
#define CPW20                            BANKMASK(SMT1CPWU), 4
#define CPW21                            BANKMASK(SMT1CPWU), 5
#define CPW22                            BANKMASK(SMT1CPWU), 6
#define CPW23                            BANKMASK(SMT1CPWU), 7
#define CPW3                             BANKMASK(SMT1CPWL), 3
#define CPW4                             BANKMASK(SMT1CPWL), 4
#define CPW5                             BANKMASK(SMT1CPWL), 5
#define CPW6                             BANKMASK(SMT1CPWL), 6
#define CPW7                             BANKMASK(SMT1CPWL), 7
#define CPW8                             BANKMASK(SMT1CPWH), 0
#define CPW9                             BANKMASK(SMT1CPWH), 1
#define CPWUP                            BANKMASK(SMT1STAT), 6
#define CREN                             BANKMASK(RC1STA), 4
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS                               BANKMASK(ADCON0), 4
#define CS5                              BANKMASK(ADCLK), 5
#define CSEL0                            BANKMASK(SMT1CLK), 0
#define CSEL1                            BANKMASK(SMT1CLK), 1
#define CSEL2                            BANKMASK(SMT1CLK), 2
#define CSRC                             BANKMASK(TX1STA), 7
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 6
#define CSWIF                            BANKMASK(PIR1), 6
#define CWG1CS                           BANKMASK(CWG1CLK), 0
#define CWG1DAT0                         BANKMASK(CWG1ISM), 0
#define CWG1DAT1                         BANKMASK(CWG1ISM), 1
#define CWG1DAT2                         BANKMASK(CWG1ISM), 2
#define CWG1DAT3                         BANKMASK(CWG1ISM), 3
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE7), 0
#define CWG1IF                           BANKMASK(PIR7), 0
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD5), 5
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define CWG2CS                           BANKMASK(CWG2CLK), 0
#define CWG2DAT0                         BANKMASK(CWG2ISM), 0
#define CWG2DAT1                         BANKMASK(CWG2ISM), 1
#define CWG2DAT2                         BANKMASK(CWG2ISM), 2
#define CWG2DAT3                         BANKMASK(CWG2ISM), 3
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5
#define CWG2EN                           BANKMASK(CWG2CON0), 7
#define CWG2IE                           BANKMASK(PIE7), 1
#define CWG2IF                           BANKMASK(PIR7), 1
#define CWG2IN                           BANKMASK(CWG2CON1), 5
#define CWG2LD                           BANKMASK(CWG2CON0), 6
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5
#define CWG2MD                           BANKMASK(PMD5), 6
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2
#define CWG2OVRA                         BANKMASK(CWG2STR), 4
#define CWG2OVRB                         BANKMASK(CWG2STR), 5
#define CWG2OVRC                         BANKMASK(CWG2STR), 6
#define CWG2OVRD                         BANKMASK(CWG2STR), 7
#define CWG2POLA                         BANKMASK(CWG2CON1), 0
#define CWG2POLB                         BANKMASK(CWG2CON1), 1
#define CWG2POLC                         BANKMASK(CWG2CON1), 2
#define CWG2POLD                         BANKMASK(CWG2CON1), 3
#define CWG2PPS0                         BANKMASK(CWG2PPS), 0
#define CWG2PPS1                         BANKMASK(CWG2PPS), 1
#define CWG2PPS2                         BANKMASK(CWG2PPS), 2
#define CWG2PPS3                         BANKMASK(CWG2PPS), 3
#define CWG2PPS4                         BANKMASK(CWG2PPS), 4
#define CWG2REN                          BANKMASK(CWG2AS0), 6
#define CWG2SHUTDOWN                     BANKMASK(CWG2AS0), 7
#define CWG2STRA                         BANKMASK(CWG2STR), 0
#define CWG2STRB                         BANKMASK(CWG2STR), 1
#define CWG2STRC                         BANKMASK(CWG2STR), 2
#define CWG2STRD                         BANKMASK(CWG2STR), 3
#define DA1                              BANKMASK(SSP1STAT), 5
#define DA2                              BANKMASK(SSP2STAT), 5
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1MD                           BANKMASK(PMD3), 6
#define DAC1NSS                          BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5
#define DC                               BANKMASK(STATUS), 1
#define DOE                              BANKMASK(CPUDOZE), 4
#define DONE                             BANKMASK(ADCON0), 0
#define DOZE0                            BANKMASK(CPUDOZE), 0
#define DOZE1                            BANKMASK(CPUDOZE), 1
#define DOZE2                            BANKMASK(CPUDOZE), 2
#define DOZEN                            BANKMASK(CPUDOZE), 6
#define DSEN                             BANKMASK(ADCON1), 0
